import os
os.system('cls||clear')

import random
# Вычислить число pi c заданной точностью d. 
# Число d находится в интервале [1e-1, 1e-10] (0.1 , 0.0000000001 )


# Задать число pi
pi = 3.1415926535897932384626433832795028841971693993751058209749445923078164062862 
# Задать число d
d = 0.001

# Количество итераций
count = 0

# До какого числа округлаяе
# def el_len(d):
    # change_type = str(d)
    # d_list = list(change_type.split("."))
    # d_len = len(d_list[1])
    # return d_len

# Функция округления
# def func(pi, el_len):
#       pi

ss = list(str(pi))
print(ss)

for i in range(3+2):
    print(ss[i])
    count += 1
print(count)




















# def input_count():
#     while True:
#         num = input('Введите точность округления: ')
#         try:
#             numbers = int(num)
#             return numbers
#         except:
#             print('Вы ввели не число. Попробуйте снова.')

# count = input_count()

# def rounding(num):